quickstart/content/posts/fivearms-training.md
+++
title = "FiveArms Training"
author = ["FiveArms"]
date = 2025-02-24T19:22:00-07:00
lastmod = 2025-02-24T19:22:40-07:00
draft = false
+++

I want to improve in Rocket League, and given my current skills, rank, available time, and desire to rank up, I think I should focus on just a few mechanics at a time. I am currently focusing on:

-   Directional Air Roll
-   Aerial Shot Power
-   Backboard Doubles

This document is intended to be a resource open to anyone looking to improve in Rocket League, but is guided by my personal understanding, training, and goals. I hope this record of my own quest for self-betterment can offer something useful to you in your own journey.

""May the boost be with you." ~ Yoda, probably" ~ FiveArms (2021)

<!--more-->

Mechanics are any named, repeatable action that a player can take in the game. Dribbling the ball and wavedashing are both mechanics. Some mechanics involve the ball, and others do not.

Given this, I attempt to break down the game into mechanics (what you can do with the car or car &amp; ball), and strategy (how you should use your car to win the game).

I also provide some instruction for basic training that works on many skills at once. If you are familiar with weight training, individual mechanics can be likened to machine-training that isolates muscles, whereas these training exercises are more like free weight exercises - compound exercises that involve many muscle groups.

<div class="ox-hugo-toc toc">

<div class="heading">Table of Contents</div>

- [Car Control](#car-control)
    - [Accelerate](#accelerate)
    - [Rotate](#rotate)
    - [Jump](#jump)
    - [Dodge (Flip)](#dodge--flip)
- [Training Exercises](#training-exercises)
    - [Musty Sidewall Exercise](#musty-sidewall-exercise)
    - [Vaporwave Flip and Speedflip Exercises](#vaporwave-flip-and-speedflip-exercises)
    - [Salteroo Air Dribble Exercise](#salteroo-air-dribble-exercise)
    - [Craigthemicrowave Wall to Air Exercises](#craigthemicrowave-wall-to-air-exercises)
- [Mechanic](#mechanic)
    - [Dribble](#dribble)
    - [Half-Flip](#half-flip)
    - [Flick](#flick)
    - [Speedflip](#speedflip)
    - [Wavedash](#wavedash)
    - [Fast Aerial (Quick Aerial)](#fast-aerial--quick-aerial)
- [Strategy](#strategy)
- [Mechanics](#mechanics)
    - [Dribbling](#dribbling)
    - [Flicks](#flicks)
    - [Wavedash](#wavedash)
    - [Speedflip](#speedflip)
    - [Walldash](#walldash)
    - [Aerials](#aerials)
- [Strategy](#strategy)
    - [Positioning](#positioning)
    - [Kickoffs](#kickoffs)
    - [Shadowing](#shadowing)
    - [Rotation](#rotation)
- [Miscellaneous Tips](#miscellaneous-tips)
    - [1v1 Tips](#v1-tips)
    - [2v2 Tips](#v2-tips)
    - [3v3 Tips](#v3-tips)
- [Settings](#settings)
    - [Gameplay](#gameplay)
    - [Camera](#camera)
    - [Controls](#controls)
    - [Interface](#interface)
    - [Video](#video)
    - [Audio](#audio)
    - [Chat](#chat)
- [References](#references)
- [End Matter](#end-matter)

</div>
<!--endtoc-->


## Car Control {#car-control}


### Accelerate {#accelerate}

Accelerate the car by using the accelerate button. While on the ground, this will move the car forward at an increasing pace. In the air, this also moves the car forward a very small amount. REFERENCE The car can also be accelerated by [dodging](#dodge--flip) and [boosting](#boost). The car has a maximum speed. When approaching maximum speed, the car will reach a threshold just below maximum speed and above this threshold, the car is said to be "supersonic." When a car is supersonic it will have a trail and it will be moving fast enough to "demo" or demolish another car.


#### Boost {#boost}


### Rotate {#rotate}


#### Grounded Rotation {#grounded-rotation}

<!--list-separator-->

-  Powerslide


#### Aerial Rotation {#aerial-rotation}

<!--list-separator-->

-  Directional Air Roll


### Jump {#jump}


### Dodge (Flip) {#dodge--flip}


#### Flip Reset {#flip-reset}


## Training Exercises {#training-exercises}


### Musty Sidewall Exercise {#musty-sidewall-exercise}


### Vaporwave Flip and Speedflip Exercises {#vaporwave-flip-and-speedflip-exercises}


### Salteroo Air Dribble Exercise {#salteroo-air-dribble-exercise}


### Craigthemicrowave Wall to Air Exercises {#craigthemicrowave-wall-to-air-exercises}


## Mechanic {#mechanic}


### Dribble {#dribble}


### Half-Flip {#half-flip}


### Flick {#flick}


### Speedflip {#speedflip}


### Wavedash {#wavedash}


#### Landing Wavedash {#landing-wavedash}


#### Curvedash {#curvedash}


#### Walldash {#walldash}


### Fast Aerial (Quick Aerial) {#fast-aerial--quick-aerial}


## Strategy {#strategy}

---


## Mechanics {#mechanics}


### Dribbling {#dribbling}

Dribbling is the epitome of ball control. If you go into freeplay and
try to hit the ball and then make a second hit as quickly as possible,
after a while you start trying to _constantly_ hit the ball. That's
basically dribbling. Always touching/hitting the ball.

This level of ball control is required for many other mechanics like
[flicking](#flicks) and air-dribbling. The earlier you can start
dribbling, the better.


#### Dribbling Resources {#dribbling-resources}

<!--list-separator-->

-  Training Packs

    -   04C1-42C8-6E5D-6F75 (suggested by
        [Virge](https://www.youtube.com/channel/UCWDuIMQM0wF-WHJINS8vwRA))
    -   6F35-CE3B-ABCB-FE13 (suggested by
        [Wayton](https://www.youtube.com/channel/UCeg2dFpnarFPI14hbN_5rKg)
        Pilkin)
    -   9D87-258C-3C05-6FA9 (suggested by
        [Thanovic](https://www.youtube.com/channel/UCd1A9A5JGDtLxCrc59yHncg))
    -   9E8D-D9BC-E12E-7C1A (suggested by
        [Thanovic](https://www.youtube.com/channel/UCd1A9A5JGDtLxCrc59yHncg))

<!--list-separator-->

-  Workshop Maps

    -   ["Noob
        Dribble"](https://steamcommunity.com/sharedfiles/filedetails/?id=1843822064) by
        [dmc](https://steamcommunity.com/id/dmc8217/myworkshopfiles/?appid=252950)
    -   ["Dribbling
        Challenge #2"](https://steamcommunity.com/sharedfiles/filedetails/?id=964271505) by
        [French
        Fries](https://steamcommunity.com/id/futcha/myworkshopfiles/?appid=252950)
    -   ["Dribble
        2 Overhaul"](https://steamcommunity.com/sharedfiles/filedetails/?id=1694288506) by
        [0xDigby](https://steamcommunity.com/id/0xDigby/myworkshopfiles/?appid=252950)

<!--list-separator-->

-  YouTube Videos

    -   [Rocket Science
        dribbling physics](https://www.youtube.com/watch?v=sLOxr4V-_r0)
    -   [SunlessKhan ball
        control](https://www.youtube.com/watch?v=U5VXmGx9ou0&t=232s)
    -   [SquishyMuffinz
        dribbling tutorial](https://www.youtube.com/watch?v=Il7nZS3hKmA)
    -   [Virge dribbling
        tutorial](https://www.youtube.com/watch?v=R7BjjxUf4J4)
    -   [Wayton dribbling for
        beginners](https://www.youtube.com/watch?v=576yfVb3MUM)
    -   [Thanovic
        dribbling all skill levels](https://www.youtube.com/watch?v=C_w4M4twl2E&t=105)


### Flicks {#flicks}

Flicks allow a player to quickly transfer a lot of momentum to the ball
from their car. This is accomplished by getting multiple touches on the
ball, rotating the car, and taking advantage of the dodge/flip mechanic
to add momentum directly.

-   Directional Flicks
    -   Front-flip flick
    -   Side-flip flick
    -   Back-flip flick
-   Angled Flicks
    -   45 Degree flick
        -   (see
            [article
            in resources below](http://team-dignitas.net/articles/blogs/rocket-league/12789/how-to-master-the-45-degree-flick))
        -   (see Kingpin's
            [tutorial on 45
            degree flicks](https://www.youtube.com/watch?v=Gt4wTng5k4s))
    -   90 Degree flick
-   Named Flicks
    -   Farms Flick
    -   [Musty](https://www.youtube.com/channel/UC1GFqqHIBaiCW1ivJJCFTvg)
        Flick
    -   Breezi Flick


#### Flicks Resources {#flicks-resources}

<!--list-separator-->

-  Articles

    -   [_How
