quickstart/content/posts/fivearms-training.md
        to Master the 45-Degree Flick_ by RedRL](http://team-dignitas.net/articles/blogs/rocket-league/12789/how-to-master-the-45-degree-flick)

<!--list-separator-->

-  YouTube Videos

    -   [Rocket Science
        Flick Explanation](https://www.youtube.com/watch?t=830&v=DRO8-784eSk)
    -   [Thanovic flick
        tutorial](https://www.youtube.com/watch?v=c9-ISPmsOF4&t=107s)
    -   [Virge (and KingRanny)
        flick tutorial](https://www.youtube.com/watch?v=KWZKfzVvSJQ)
    -   [Wayton flick tutorial](https://www.youtube.com/watch?v=ZWdheraunb4)
    -   [SquishyMuffinz
        flicking tutorial](https://www.youtube.com/watch?v=Il7nZS3hKmA&t=90)
    -   [Kingpin 45 degree flick
        tutorial](https://www.youtube.com/watch?v=Gt4wTng5k4s)


### Wavedash {#wavedash}

Wavedash is a term borrowed from the Super Smash Brothers Melee fighting
game, and refers (in Rocket League) to a mechanic that helps a player
gain momentum. By combining the effect of increased player momentum from
a dodge/flip with running the car into the ground, one can quickly gain
speed. See
[Rocket
Science](https://www.youtube.com/channel/UCfKidiMlHTBRNkQZlLzUesw)'s video on
[dodge momentum](https://www.youtube.com/watch?v=pX950bhGhJE) for
reference.

The simplest explanation: give a dodge input (direction and jump) when
only two of the four car wheels are touching the ground. The car will
immediately gain momentum from having "dodged." The car will also
attempt to rotate, but because the ground is in the way, it will only
slam the car flat to the ground and allow the player to keep their new
momentum.


#### Curvedash {#curvedash}

Wavedashing without boost, while making use of any curved surface to
shorten the airborne duration of the dash. Explained concisely and
precisely by
[Rocket
Science](https://www.youtube.com/channel/UCfKidiMlHTBRNkQZlLzUesw) in his video on the subject:
[Curvedashing New
mechanic? Instant supersonic with no boost](https://www.youtube.com/watch?v=PuB6yLVSs5s)


#### Landing Wavedash {#landing-wavedash}

The general idea is that you land with your front wheels first, and
execute a wavedash as soon as the rear wheels touch down. Due to the
car's suspension, your jump should leave the back wheels on the ground,
making the wavedash nearly instantaneous.

Please see the
[Rocket
Science](https://www.youtube.com/channel/UCfKidiMlHTBRNkQZlLzUesw) video on the subject:
[Landing Wavedash when you
don't have a dodge](https://www.youtube.com/watch?v=baNsqFEfRMY)

My tips: - keep your car in your peripheral vision like you would
wavedashing in a game; you're better at knowing the timing than you
think! - hold forward (pitch forward) as you land, and make your two
jump presses as close together as possible (wheelie press, dash press);
N.B. pitching forward pulls the rear wheels up and requires delaying the
wheelie press - experiment with having forward momentum or not; I think
holding accelerate the whole time helps


#### Wavedash Resources {#wavedash-resources}

<!--list-separator-->

-  YouTube Videos

    -   [SquishyMuffinz
        recovery tips - wavedash](https://www.youtube.com/watch?v=dywxcjl7B9E&t=118)


### Speedflip {#speedflip}

Rocket League is easier when you are faster than your opponents. Dodging
(flipping) is one of the easiest and most common ways to increase your
car's speed. If every flip you do is the fastest possible flip, then you
will be at an advantage.

Because diagonal flips are the best way to increase your forward
momentum (see [dodge momentum resource](#dodge-momentum-explanation)),
we want to use them but cancel their forward-pitch rotation (see
[speedflip tutorials](#youtube-tutorials)). This combined with
precise timing and recovery should allow us to quickly increase our
car's forward momentum faster than any other mechanic.

My best summary of how to speedflip (once you understand the mechanic
generally) is: flip-cancel as _early_ as possible, and recover as _late_
as possible. Cancel the dodge **immediately**, then wait as long as you
can to flip the stick again for your recovery.


#### Speedflip Resources {#speedflip-resources}

<!--list-separator-->

-  Dodge Momentum Explanation

    -   [Rocket Science dodge
        momentum](https://www.youtube.com/watch?v=pX950bhGhJE)

<!--list-separator-->

-  YouTube Tutorials

    -   [Awsome Gaming speedflip
        mistake corrections](https://www.youtube.com/watch?v=Fnw0QwwIlEQ)
    -   [Thanovic speedflip
        tutorial](https://www.youtube.com/watch?v=4iKouXvdh8I)
    -   [Linkuru speedflip
        tutorial](https://www.youtube.com/watch?v=TozvB7XpPY0)
    -   [Musty speedflip
        (kickoff) tutorial](https://www.youtube.com/watch?v=5aCasHy0Idg)
    -   [Helical speedflip
        tutorial](https://www.youtube.com/watch?v=X5VL6ih7ee0)
    -   [Fireburner
        speedflip tutorial](https://www.youtube.com/watch?v=h2Eg-4XwIic&t=40)

<!--list-separator-->

-  Training Packs

    -   A503-264C-A7EB-D282
        _[Musty](https://www.youtube.com/channel/UC1GFqqHIBaiCW1ivJJCFTvg) -
        SpeedFlip Kickoff Test_
    -   BFAA-45A5-7A56-73CC Fast Kickoff
        ([VaporGB](https://www.reddit.com/r/RocketLeague/comments/5jrvim/fast_kickoff_training_sequence/))


### Walldash {#walldash}


#### A Caveat {#a-caveat}

Dashing on the wall requires sticking to the wall after a dodge executed
from low height (off the wall). IIRC, the fake, sticky force that glues
cars to non-ground surfaces is increased with car speed. This means that
walldashing is _easiest at top speed_ and gets harder the slower your
car is when you start. (See
[Kevpert's
video](https://youtu.be/gDfm4zPwVZw?si=MX-jslexkCbUccEz&t=472) for more here.) Again, being sub-sonic makes walldashing harder.
(I think Kevpert even suggests needing to be about 70 or 80% max speed.)


#### What is a Walldash? {#what-is-a-walldash}

A walldash is executed by a car when it drives along a wall, jumps,
immediately dodges up the wall (toward the ceiling), and lands
(sticking) to the wall it had just jumped from.

<!--list-separator-->

-  Why can't we just do the definition?

    There are two problems with a naïve attempt at a walldash.

    1.  A side-dodge gives a momentum boost in the direction of the
        side-dodge. If the car dodges perfectly "up" (toward the ceiling)
        when driving parallel to the ground, the car does **not** gain forward
        momentum. To gain momentum in the driving direction, the dodge must
        have a forward component (i.e. must be a diagonal dodge). Dodging up
        (even diagonally) will start turning the car up the wall. This can be
        countered by pointing the nose of the car "down" (toward the ground)
        before executing the dodge "up." (n.b. This is the same technique
        used for speed-flipping in a straight line. This means that there can
        be some variance in how players achieve this effect. The difference
        in turning before or after jumping will be the speed with which the
        nose of the car actually changes direction. On the wall, the car's
        turning speed will be the determining factor. In the air, the car's
        rotational acceleration around the z-axis will be the determining
        factor.)


#### How to Walldash {#how-to-walldash}

There are three steps to a walldash that, when executed precisely, can
be chained into consecutive walldashes (chain-dashing). The following
list includes step one as a prerequisite - steps two, three, and four
form the "chainable" walldash.

1.  Drive near top-speed along a wall (parallel to the ground).
2.  Turn the nose of the car down (toward the ground) slightly.
3.  Jump (neutral-jump) off the wall.
4.  Immediately, diagonally-dodge up-forward (toward the ceiling and
    driving direction).
