quickstart/content-org/all-posts.org
**** Extra Considerations
:PROPERTIES:
:CUSTOM_ID: extra-considerations
:END:
***** Deadzones
:PROPERTIES:
:CUSTOM_ID: deadzones
:END:
You have access to two settings in RL that change how controller input
is read and interpreted. These are the "controller deadzone" and the
"dodge deadzone" (hereafter CDZ and DDZ respectively).

First, understand that your controller is /always/ giving analog-stick
(joystick) input to the game whether you are touching the controller or
not. The stick measures two values at all times: radial deflection and
angular deflection. In other words: how far from center the stick is
pushed (radial deflection), and at what angle the stick is pushed
(angular deflection). These two values are measured and sent to your
computer at the "polling rate" of the controller. For our purposes this
means "constantly," but in actuality it happens between 200--1200 times
a second depending on your settings and controller.

****** Controller Deadzone
:PROPERTIES:
:CUSTOM_ID: controller-deadzone
:END:
Because the controller is always telling the game where its stick is and
the controller isn't a perfect device, there will almost always be some
non-zero value being registered and sent to the game. This is why the
CDZ exists. By making the CDZ just larger than the "I'm not touching the
stick, but it's reading a non-zero value," the game can /ignore/ that
input and treat it as zero. Use [[https://www.gamepad-tester.com][a
testing software]] to see your controller's highest radial deflection
after moving and releasing the stick. Set your CDZ in Rocket League to
the closest but higher value. For example: after flicking the stick then
reading the "at rest" value a few times, you see your controller reads
0.045, 0.067, 0.059, etc. You then set your CDZ in RL to 0.07 (as close
to your highest reading as you can get while still being greater).

****** Dodge Deadzone
:PROPERTIES:
:CUSTOM_ID: dodge-deadzone
:END:
In order for a player's second jump input to be a dodge (instead of a
neutral-jump), the game must register a coincident, radial stick
deflection. In other words: to dodge, you must push the stick in (any)
direction some minimum amount. How much? To a value greater than your
dodge deadzone. For walldashing, the smaller the DDZ, the less stick
movement required for dodging, and therefore the faster one can give
dodge input. (n.b. Making the DDZ lower than the CDZ means all second
jumps are dodges.) Set your DDZ as low as you can without accidentally
getting dodge inputs in game (if you start accidentally backflipping all
the time, you need a bigger DDZ). I use a value near 0.70, but this is
different for everyone.

****** How does this relate to walldashing?
:PROPERTIES:
:CUSTOM_ID: how-does-this-relate-to-walldashing
:END:
Use [[https://halfwaydead.gitlab.io/rl-deadzone/][HalfwayDead's tool to
visualize your deadzones]]. In the graph on the right, you can see your
dodge input with diagonal dodge input registering only when the stick is
in the green sections of the circle. Notice that changing the DDZ
doesn't change the angular area of the diagonal dodge sections at all.
Notice that making the CDZ bigger reduces the angular area of the
diagonal dodge sections, and making it /smaller/ will /increase/ the
available angles for getting a diagonal dodge. (n.b. Also notice that a
smaller CDZ makes it easier to turn or harder to drive straight.)

***** Hitboxes
:PROPERTIES:
:CUSTOM_ID: hitboxes
:END:
I can't confirm anything here, but given that each car has a unique
wheel placement relative to their hitbox, some cars may bonk and not
stick more than others. Similarly, because each hitbox preset has a
unique turning radius (see
[[http://cars.rocketscience.fyi/][HalfwayDead's spreadsheet]]), the
amount of turning needed to correct the dodge on the wall may be
slightly different for each hitbox preset.

*** Aerials
:PROPERTIES:
:CUSTOM_ID: aerials
:END:
- [[https://www.youtube.com/watch?t=141&v=d_7VLNiHgY8][Thanovic aerial
  car control]]

**** Fast Aerials
:PROPERTIES:
:CUSTOM_ID: fast-aerials
:END:
Fast aerialing refers to moving your car from the ground up to some
height in the fastest possible way. Constantly boosting while getting
maximum "up-force" from your jumps will be the tools used to fight
gravity. Practice, timing, and coordination will let you go up faster.

While boosting: press and hold jump for 0.2 seconds, and pitch up by
pulling back on your left stick. Continue boosting, but let your stick
return to a neutral position. Keep boosting, input another full jump,
then pitch up some more with your stick. All together: hold boost, jump,
tilt, jump, tilt (aim).

You want to hold your first jump for 0.2 seconds. You can practice with
a metronome set to 250bpm. See
[[https://www.youtube.com/channel/UCfKidiMlHTBRNkQZlLzUesw][Rocket
Science]]'s video for explanation: https://youtu.be/Y9o8ZPEwwK8?t=687

**** Aerial Control
:PROPERTIES:
:CUSTOM_ID: aerial-control
:END:
Controlling your car in the air is the first step to using the air to
your advantage. See Kingpin's video's for introductions:

- https://www.youtube.com/watch?v=VxRgoqwnW6Y Simplified
- https://www.youtube.com/watch?v=XimS3RBAVlQ Using pillars

Try using Dreale's workshop map for a built-in training experience:
https://steamcommunity.com/sharedfiles/filedetails/?id=1816559771

**** Directional Air Roll
:PROPERTIES:
:CUSTOM_ID: directional-air-roll
:END:
First, we must establish a common vocabulary. When the car is in the
air, it can rotate around three axes just like a plane (see
[[https://en.wikipedia.org/wiki/Aircraft_principal_axes][principle axes
resource]]) and these three rotations are controlled by the left analog
stick. Up/down on the stick gives pitch control, left/right gives yaw
control, and if the "air roll" button is held then left/right instead
gives roll control. Since left/right analog stick movement corresponds
to both roll and yaw control, it is impossible to give both inputs
simultaneously without binding additional control buttons. The "air roll
left" and "air roll right" bindings provide a button that gives their
named inputs and free up the left/right stick to give simultaneous yaw
control.

- stick =up/down= gives =+/-= pitch (up/down)
- stick =left/right= gives =-/+= yaw (left/right)
- "air roll" and stick =left/right= gives =-/+= roll (left/right)
  - "air roll left" gives =-= roll (left)
  - "air roll right" gives =+= roll (right)

From a neutral position (hovering in the air, nose up, tail down, top
facing you), we can boost through various rotations to move the car's
position while leaving its final orientation the same as its initial
orientation. Boosting through any of these rotational control inputs
provides consistent control as follows:

| Roll | Pitch | Yaw | RESULT   |
|------+-------+-----+----------|
| -    | +     | 0   | RIGHT    |
| -    | -     | 0   | LEFT     |
| -    | 0     | +   | BACKWARD |
| -    | 0     | -   | FORWARD  |

The first row of the table can be read as the following: by starting
from the neutral position and boosting while holding "air roll left",
holding the left analog stick up, and not holding the stick left/right -
all for one full rotation of the car - the car will have moved to the
right and returned to the neutral position. Or more succinctly:

- Roll (left/negative) + Pitch (up/positive) + Yaw (neutral) = rightward
  motion

***** Directional Air Roll Resources
:PROPERTIES:
:CUSTOM_ID: directional-air-roll-resources
:END:
****** Articles
:PROPERTIES:
:CUSTOM_ID: articles-1
:END:
- [[https://en.wikipedia.org/wiki/Aircraft_principal_axes][Wikipedia -
  Aircraft principle axes]] ##### YouTube Tutorials
- [[https://www.youtube.com/watch?v=ens6Bs5SVcs][Tipp Air Roll Left
  Guide]]
- [[https://www.youtube.com/watch?v=0_x2UQqQ2mY][Thanovic Air Roll
  Control]]
- [[https://www.youtube.com/watch?v=YDofLn_K3yE][SpookLuke Learn to Air
  Roll]]

--------------

