quickstart/content/posts/fivearms-training.md


#### Extra Considerations {#extra-considerations}

<!--list-separator-->

-  Deadzones

    You have access to two settings in RL that change how controller input
    is read and interpreted. These are the "controller deadzone" and the
    "dodge deadzone" (hereafter CDZ and DDZ respectively).

    First, understand that your controller is _always_ giving analog-stick
    (joystick) input to the game whether you are touching the controller or
    not. The stick measures two values at all times: radial deflection and
    angular deflection. In other words: how far from center the stick is
    pushed (radial deflection), and at what angle the stick is pushed
    (angular deflection). These two values are measured and sent to your
    computer at the "polling rate" of the controller. For our purposes this
    means "constantly," but in actuality it happens between 200--1200 times
    a second depending on your settings and controller.

    <!--list-separator-->

    -  Controller Deadzone

        Because the controller is always telling the game where its stick is and
        the controller isn't a perfect device, there will almost always be some
        non-zero value being registered and sent to the game. This is why the
        CDZ exists. By making the CDZ just larger than the "I'm not touching the
        stick, but it's reading a non-zero value," the game can _ignore_ that
        input and treat it as zero. Use [a
        testing software](https://www.gamepad-tester.com) to see your controller's highest radial deflection
        after moving and releasing the stick. Set your CDZ in Rocket League to
        the closest but higher value. For example: after flicking the stick then
        reading the "at rest" value a few times, you see your controller reads
        0.045, 0.067, 0.059, etc. You then set your CDZ in RL to 0.07 (as close
        to your highest reading as you can get while still being greater).

    <!--list-separator-->

    -  Dodge Deadzone

        In order for a player's second jump input to be a dodge (instead of a
        neutral-jump), the game must register a coincident, radial stick
        deflection. In other words: to dodge, you must push the stick in (any)
        direction some minimum amount. How much? To a value greater than your
        dodge deadzone. For walldashing, the smaller the DDZ, the less stick
        movement required for dodging, and therefore the faster one can give
        dodge input. (n.b. Making the DDZ lower than the CDZ means all second
        jumps are dodges.) Set your DDZ as low as you can without accidentally
        getting dodge inputs in game (if you start accidentally backflipping all
        the time, you need a bigger DDZ). I use a value near 0.70, but this is
        different for everyone.

    <!--list-separator-->

    -  How does this relate to walldashing?

        Use [HalfwayDead's tool to
        visualize your deadzones](https://halfwaydead.gitlab.io/rl-deadzone/). In the graph on the right, you can see your
        dodge input with diagonal dodge input registering only when the stick is
        in the green sections of the circle. Notice that changing the DDZ
        doesn't change the angular area of the diagonal dodge sections at all.
        Notice that making the CDZ bigger reduces the angular area of the
        diagonal dodge sections, and making it _smaller_ will _increase_ the
        available angles for getting a diagonal dodge. (n.b. Also notice that a
        smaller CDZ makes it easier to turn or harder to drive straight.)

<!--list-separator-->

-  Hitboxes

    I can't confirm anything here, but given that each car has a unique
    wheel placement relative to their hitbox, some cars may bonk and not
    stick more than others. Similarly, because each hitbox preset has a
    unique turning radius (see
    [HalfwayDead's spreadsheet](http://cars.rocketscience.fyi/)), the
    amount of turning needed to correct the dodge on the wall may be
    slightly different for each hitbox preset.


### Aerials {#aerials}

-   [Thanovic aerial
    car control](https://www.youtube.com/watch?t=141&v=d_7VLNiHgY8)


#### Fast Aerials {#fast-aerials}

Fast aerialing refers to moving your car from the ground up to some
height in the fastest possible way. Constantly boosting while getting
maximum "up-force" from your jumps will be the tools used to fight
gravity. Practice, timing, and coordination will let you go up faster.

While boosting: press and hold jump for 0.2 seconds, and pitch up by
pulling back on your left stick. Continue boosting, but let your stick
return to a neutral position. Keep boosting, input another full jump,
then pitch up some more with your stick. All together: hold boost, jump,
tilt, jump, tilt (aim).

You want to hold your first jump for 0.2 seconds. You can practice with
a metronome set to 250bpm. See
[Rocket
Science](https://www.youtube.com/channel/UCfKidiMlHTBRNkQZlLzUesw)'s video for explanation: <https://youtu.be/Y9o8ZPEwwK8?t=687>


#### Aerial Control {#aerial-control}

Controlling your car in the air is the first step to using the air to
your advantage. See Kingpin's video's for introductions:

-   <https://www.youtube.com/watch?v=VxRgoqwnW6Y> Simplified
-   <https://www.youtube.com/watch?v=XimS3RBAVlQ> Using pillars

Try using Dreale's workshop map for a built-in training experience:
<https://steamcommunity.com/sharedfiles/filedetails/?id=1816559771>


#### Directional Air Roll {#directional-air-roll}

First, we must establish a common vocabulary. When the car is in the
air, it can rotate around three axes just like a plane (see
[principle axes
resource](https://en.wikipedia.org/wiki/Aircraft_principal_axes)) and these three rotations are controlled by the left analog
stick. Up/down on the stick gives pitch control, left/right gives yaw
control, and if the "air roll" button is held then left/right instead
gives roll control. Since left/right analog stick movement corresponds
to both roll and yaw control, it is impossible to give both inputs
simultaneously without binding additional control buttons. The "air roll
left" and "air roll right" bindings provide a button that gives their
named inputs and free up the left/right stick to give simultaneous yaw
control.

-   stick `up/down` gives `+/-` pitch (up/down)
-   stick `left/right` gives `-/+` yaw (left/right)
-   "air roll" and stick `left/right` gives `-/+` roll (left/right)
    -   "air roll left" gives `-` roll (left)
    -   "air roll right" gives `+` roll (right)

From a neutral position (hovering in the air, nose up, tail down, top
facing you), we can boost through various rotations to move the car's
position while leaving its final orientation the same as its initial
orientation. Boosting through any of these rotational control inputs
provides consistent control as follows:

| Roll | Pitch | Yaw | RESULT   |
|------|-------|-----|----------|
| -    | +     | 0   | RIGHT    |
| -    | -     | 0   | LEFT     |
| -    | 0     | +   | BACKWARD |
| -    | 0     | -   | FORWARD  |

The first row of the table can be read as the following: by starting
from the neutral position and boosting while holding "air roll left",
holding the left analog stick up, and not holding the stick left/right -
all for one full rotation of the car - the car will have moved to the
right and returned to the neutral position. Or more succinctly:

-   Roll (left/negative) + Pitch (up/positive) + Yaw (neutral) = rightward
    motion

<!--list-separator-->

-  Directional Air Roll Resources

    <!--list-separator-->

    -  Articles

        -   [Wikipedia -
            Aircraft principle axes](https://en.wikipedia.org/wiki/Aircraft_principal_axes) ##### YouTube Tutorials
        -   [Tipp Air Roll Left
            Guide](https://www.youtube.com/watch?v=ens6Bs5SVcs)
        -   [Thanovic Air Roll
            Control](https://www.youtube.com/watch?v=0_x2UQqQ2mY)
        -   [SpookLuke Learn to Air
            Roll](https://www.youtube.com/watch?v=YDofLn_K3yE)

        ---
