quickstart/content-org/all-posts.org
** Strategy
:PROPERTIES:
:CUSTOM_ID: strategy
:END:
*** Positioning
:PROPERTIES:
:CUSTOM_ID: positioning
:END:
**** Positioning Goal-side
:PROPERTIES:
:CUSTOM_ID: positioning-goal-side
:END:
**** Positioning Inside
:PROPERTIES:
:CUSTOM_ID: positioning-inside
:END:
**** Positioning Outside
:PROPERTIES:
:CUSTOM_ID: positioning-outside
:END:
*** Kickoffs
:PROPERTIES:
:CUSTOM_ID: kickoffs
:END:
The original, gold-standard for kick-off:
https://www.youtube.com/watch?v=JFn3Ye90IKc If you can do this style of
kickoff well, you will be doing better kickoffs than at least half of
the playerbase.

Here are two general guides for getting the basics of kickoffs: -
winning the kickoff basics :
https://www.gamersrdy.com/blog/2020/11/27/kickoffs-in-rocket-league-guide/ -
getting there first and best :
https://www.dailyesports.gg/rocket-league-kick-off-strategy-guide/

**** Cheat-up
:PROPERTIES:
:CUSTOM_ID: cheat-up
:END:
This is where you grab a couple 12-pads and follow behind the first
player to immediately follow up the kickoff 50/50.

**** Dead-ball
:PROPERTIES:
:CUSTOM_ID: dead-ball
:END:
When the kickoff 50/50 results in the ball mostly staying in the center
circle. The ball's momentum is "dead." Excellent opportunity for a
teammate if they cheated up.

*** Shadowing
:PROPERTIES:
:CUSTOM_ID: shadowing
:END:
**** Shadow Defense
:PROPERTIES:
:CUSTOM_ID: shadow-defense
:END:
*** Rotation
:PROPERTIES:
:CUSTOM_ID: rotation
:END:
**** Near-post Rotation
:PROPERTIES:
:CUSTOM_ID: near-post-rotation
:END:
**** Far-post Rotation
:PROPERTIES:
:CUSTOM_ID: far-post-rotation
:END:
**** Team Rotation
:PROPERTIES:
:CUSTOM_ID: team-rotation
:END:
***** 2v2
:PROPERTIES:
:CUSTOM_ID: v2
:END:
***** 3v3
:PROPERTIES:
:CUSTOM_ID: v3
:END:
- [[https://www.youtube.com/watch?v=v1KSnQmuigk][How to Attack in 3s]]

--------------

** Miscellaneous Tips
:PROPERTIES:
:CUSTOM_ID: miscellaneous-tips
:END:
These are poorly documented tips that I've either synthesized myself or
have come directly from other (better) Rocket League players. I have not
done well to attribute individual contributions here, and I apologize.
Persons contributing include - but are not limited to - xHardDrive,
Nekrosisx, PlantDaddyGaming, Rylak09, and Unknown.

- don't give it to them
- In game? unlucky. During review? mistake.
- rotate backpost/backwall at kickoff
- think about the way you turn (what are you covering?)
- challenge the flip-reset early when it's at penalty box or closer
- "fake far, go close"
- don't be in the same offensive corner as your partner
- pass laterally not in a straight line
- if you're going to challenge a ball in a corner, dive for it and go
  all-in.
- powerslide-jump off backboard landings (or any surface)
- use big circles to idle in good places
- wavedash-flips - they're huge (for recoveries)
- [[https://docs.google.com/spreadsheets/d/e/2PACX-1vSFVhOwmxwoefm8UuOivfEmryHMpoggqYSFI1t8FE25UMT9LaRmctl3T_2vukxMaiSRNSLtZPqrFfID/pubhtml][Turnup's
  Rocket League Resources Spreadsheet]]
- [[https://docs.google.com/spreadsheets/d/1RZebwwQHvXgPm_TodWLOHJbBihqXAYdfIZDEMG87Veo/edit#gid=0][RLCord
  Custom Training Packs]]

*** 1v1 Tips
:PROPERTIES:
:CUSTOM_ID: v1-tips
:END:
- take diagonal lines - don't go straight at the goal/goalie

*** 2v2 Tips
:PROPERTIES:
:CUSTOM_ID: v2-tips
:END:
- keep momentum, don't stop yourself
- don't throw the ball to them helpfully
- don't get antsy and dive in to force a play
- height makes right - at least make them waste boost
- if he's in the air, don't be there
- never go into the corner your teammate is in
- If you think you need to hit (but only around 1st), 50 it instead
- possession and aggression - have the ball, then aggress when they have
  the ball. Make them /have/ to give it away.
- first man only covers bad-hits and no-hits; second covers strong-hits
  (zones)
- shadow along wall all the way to your own corner
- as last back: fake-challenge, buy time, save
- don't push ball through corner uselessly (possession play through
  corners; or bump!)

*** 3v3 Tips
:PROPERTIES:
:CUSTOM_ID: v3-tips
:END:
- if you're first: dive, attack, commit, go; if you're last: shadow till
  the ball is on the goal-line
- gotta challenge
- don't rotate ball-side
- go under them, not over them (especially in your half)

--------------

** Settings
:PROPERTIES:
:CUSTOM_ID: settings
:END:
*** Gameplay
:PROPERTIES:
:CUSTOM_ID: gameplay
:END:
- Splitscreen Layout :: Vertical
- Cross-platform Play :: TRUE
- Client Send Rate :: High
- Server Send Rate :: High
- Bandwidth Limit :: High
- Input Buffer :: STS
- Show Competitive Divisions :: TRUE
- Show Extra Mode Ranks :: TRUE
- Game Stat Display Level :: Main Stats Only
- Tournament Schedule Region :: US-West

*** Camera
:PROPERTIES:
:CUSTOM_ID: camera
:END:
- Camera Preset :: Custom
- Camera Shake :: FALSE
- Field of View :: 109
- Distance :: 260.00
- Height :: 110.00
- Angle :: -3.00
- Stiffness :: 0.65
- Swivel Speed :: 5.00
- Transition Speed :: 1.50
- Invert Swivel :: TRUE

*** Controls
:PROPERTIES:
:CUSTOM_ID: controls
:END:
- Steering Sensitivity :: 1.24
- Aerial Sensitivity :: 1.24
- Controller Deadzone :: 0.10
- Dodge Deadzone :: 0.10
- Controller Vibration :: FALSE
- Vibration Intensity :: 0.20
- Ball Camera Mode :: Toggle
- Mouse Sensitivity :: 10.00
- Keyboard Input Acceleration Time :: 0.00
- Keyboard Aerial Safety :: TRUE

*** Interface
:PROPERTIES:
:CUSTOM_ID: interface
:END:
- Interface Scale :: 100%
- Display Scale :: 100%
- Nameplate Scale :: 150%
- Nameplate Mode :: Default
- Match Notifications :: All
- Connection Quality Indicators :: TRUE
- Color Blind Mode :: FALSE
- Force Default Team Colors :: TRUE
- Notifications During Gameplay :: TRUE
- Team-colored Boost Meter :: TRUE
- Metric :: FALSE
- Ball Cam Indicator :: FALSE
- Ball Arrow :: TRUE
- Performance Graphs :: None
- Convert Platform Friends :: FALSE
- Allow Player-to-player Trading :: TRUE

*** Video
:PROPERTIES:
:CUSTOM_ID: video
:END:
- Window Settings
  - Resolution :: 1920 x 1080 16:9
  - Display Mode :: Borderless
  - Vertical Sync :: FALSE
- Basic Settings
  - Anti-aliasing :: FXAA High
  - Render Quality :: High Quality
  - Renderer Detail :: Custom
  - Frames Per Second :: 250 (set by Bakkesmod Plugin 'FPS cap')
- Advanced Settings
  - Texture Detail :: High Quality
  - World Detail :: Quality
  - Particle Detail :: Performance
  - Effect Intensity :: Low Intensity
  - High Quality Shaders :: TRUE
  - Ambient Occlusion :: FALSE
  - Depth of Field :: FALSE
  - Bloom :: FALSE
  - Light Shafts :: FALSE
  - Lens Flares :: FALSE
  - Dynamic Shadows :: FALSE
  - Motion Blur :: FALSE
  - Weather Effects :: FALSE
  - Transparent Goalposts :: TRUE

*** Audio
:PROPERTIES:
:CUSTOM_ID: audio
:END:
- Master :: 100%
- Gameplay :: 75%
- Music - Playlists :: 75%
- Music - Gameplay :: 75%
- Voice Chat :: 50%
- Ambient :: 75%
- Crowd :: 75%
- Output Type :: Speakers
- Dynamic Range :: Default
- Play Soundtrack in Menu :: FALSE
- Play Soundtrack in Training :: FALSE
- Play Soundtrack in Game :: FALSE
- Player Anthems :: Matches Only
- Streamer Safe Music :: TRUE
- Mute on Unfocused :: FALSE

*** Chat
:PROPERTIES:
:CUSTOM_ID: chat
:END:
- Text and Quick Chat Settings
  - Block Non-tactical Quick Chat :: FALSE
- Voice Chat Settings
  - Voice Chat :: Allow Voice Chat with Nobody (Off)

--------------

